Table of Contents
 Class MethodTask
Namespace
IdeaStatiCa.Plugin.Grpc.Reflection
Assembly
IdeaStatiCa.Plugin.dll
public class MethodTask : IMethodTask
Inheritance
object
MethodTask
Implements
IMethodTask
Inherited Members
 object.ToString()
 object.Equals(object)
 object.Equals(object, object)
 object.ReferenceEquals(object, object)
 object.GetHashCode()
 object.GetType()
 object.MemberwiseClone()
Constructors
 MethodTask(IPluginLogger, IGrpcSender, string)
public MethodTask(IPluginLogger logger, IGrpcSender grpcSender, string operationId)
Parameters
logger IPluginLogger
grpcSender IGrpcSender
operationId string
Fields
 OperationId
public readonly string OperationId
Field Value
string
Properties
 GrpcSender
public IGrpcSender GrpcSender { get; }
Property Value
IGrpcSender
Methods
 SendMessageDataSync(GrpcMessage)
public GrpcMessage SendMessageDataSync(GrpcMessage grpcMessage)
Parameters
grpcMessage GrpcMessage
Returns
GrpcMessage
 SetResult(GrpcMessage)
public void SetResult(GrpcMessage message)
Parameters
message GrpcMessage
 Edit this page